{"additional_info":{},"tag_0":{"contents":"The state of broadcast and video in APAC Ad Manager Capabilities Partner Solutions Success Stories Resources Blog Support Sign in Get started Ad Manager Capabilities Formats Video Yield Management Data & Insights Brand Safety Partner Solutions Apps TV & Broadcast Commerce News & Publishing Small Business Success Stories Resources Blog Support Sign in Get started × Tell us about your business Approximately how many monthly pageviews does your website have? Less than 1 million 1 million or more Do you have a Google AdSense account? Yes No Continue Congratulations! Congratulations! You are qualified to sign up for Google Ad Manager. Continue to sign up Sign Up for Google AdSense You need an AdSense account to work with Google Ad Manager. Sign up and come back after your application has been approved. Sign up Report APAC’s changing digital landscape: How broadcast and video companies can keep up Tags Advanced TV Video This piece was originally published on Think With Google Asia-Pacific. The broadcast and video industry today looks very different than it did a few years ago. Broadcasters all over the world are working hard to adapt as the pace of change accelerates and scale becomes more important than ever before. Nowhere is this more true than in APAC, which has become home to more than half of all global digital video viewers (1.3 billion) — 2X more than five years ago. And with 66% of digital video viewers watching on smartphones,1 it’s clear that almost everything about the way people are consuming content — from what they watch to how they watch it — is changing. As bandwidth capabilities continue to grow, streaming will only become more affordable and accessible for consumers, leading to rapid growth in video consumption. All this change creates a constant stream of both challenges and opportunities for the industry, as competition and consumer expectations increase. Our team works with APAC broadcasters and video providers to meet these challenges head on. Hear from some of our partners about the challenges they’re facing. Email support available Tackling the digital transformation together Making the shift to digital and keeping up with always-on consumers can be difficult. To keep up with the rapid pace of change while staying relevant, and building scalable businesses for the future, innovation-led partnerships and collaborations will be critical for all players. This is why we work with our partners in APAC across five key pillars of the media industry: Content development: Leveraging new technology and data capabilities allows for the automation of media workflows, better understanding of audiences, and more effective creation of experiential content like virtual reality and augmented reality. We work with our partners to find the best means of using these technologies. Content distribution: Whether partners are looking at developing robust owned-and-operated platforms or working with third parties, we aim to help them connect with viewers while staying at the forefront of technology. Viewer acquisition and engagement: To accelerate focus on direct-to-consumer businesses, we work with our partners to drive the right viewers to the right content, enable content discovery, and facilitate deep brand engagement. Flexible monetization: With free, premium content or “freemium” emerging as the dominant revenue model for digital video, partners need to leverage monetization solutions which are suitable across advertising, subscription, and transactional business models to maximize potential across audience types. We work with them to find the right methods. Efficiency and insights: We help partners discover deeper data, insights, and workflow efficiencies, fueled by machine learning, data visualization, and analytics, via the cloud infrastructure. As the APAC broadcast and video industry continues to evolve, the importance of adapting to these changes remains constant. eMarketer, Digital Video Viewers by Countries, 2019. Share article You might also like: {[item.metadata.article_type]} {[item.title]} Read more See all resources Follow us About Google Ad Manager Overview Capabilities Partner Solutions Learning & support Support Blog Skillshop Developers & partners Google developers site Ad Manager for developers Certified Publishing Partners Related products Google Marketing Platform Google Ads Google AdSense Google AdMob Google Cloud More from Google Think with Google Google Revenue Solutions Business Solutions Google Workspace Privacy Terms About Google Google Products Help","tag":"html"},"tag_1":{"contents":"The state of broadcast and video in APAC","tag":"head"},"tag_10":{"contents":"Ad Manager","tag":"a"},"tag_100":{"contents":"No","tag":"label"},"tag_101":{"contents":"Continue","tag":"div"},"tag_102":{"contents":"Continue","tag":"button"},"tag_103":{"contents":"Congratulations! Congratulations! You are qualified to sign up for Google Ad Manager. Continue to sign up Sign Up for Google AdSense You need an AdSense account to work with Google Ad Manager. Sign up and come back after your application has been approved. Sign up","tag":"div"},"tag_104":{"contents":"Congratulations! Congratulations! You are qualified to sign up for Google Ad Manager. Continue to sign up","tag":"div"},"tag_105":{"contents":"Congratulations!","tag":"h2"},"tag_106":{"contents":"Congratulations! You are qualified to sign up for Google Ad Manager.","tag":"p"},"tag_107":{"contents":"Continue to sign up","tag":"div"},"tag_108":{"contents":"Continue to sign up","tag":"a"},"tag_109":{"contents":"Sign Up for Google AdSense You need an AdSense account to work with Google Ad Manager. Sign up and come back after your application has been approved. Sign up","tag":"div"},"tag_11":{"contents":"Ad Manager","tag":"span"},"tag_110":{"contents":"Sign Up for Google AdSense","tag":"h2"},"tag_111":{"contents":"You need an AdSense account to work with Google Ad Manager. Sign up and come back after your application has been approved.","tag":"p"},"tag_112":{"contents":"Sign up","tag":"div"},"tag_113":{"contents":"Sign up","tag":"a"},"tag_114":{"contents":"Report APAC’s changing digital landscape: How broadcast and video companies can keep up Tags Advanced TV Video This piece was originally published on Think With Google Asia-Pacific. The broadcast and video industry today looks very different than it did a few years ago. Broadcasters all over the world are working hard to adapt as the pace of change accelerates and scale becomes more important than ever before. Nowhere is this more true than in APAC, which has become home to more than half of all global digital video viewers (1.3 billion) — 2X more than five years ago. And with 66% of digital video viewers watching on smartphones,1 it’s clear that almost everything about the way people are consuming content — from what they watch to how they watch it — is changing. As bandwidth capabilities continue to grow, streaming will only become more affordable and accessible for consumers, leading to rapid growth in video consumption. All this change creates a constant stream of both challenges and opportunities for the industry, as competition and consumer expectations increase. Our team works with APAC broadcasters and video providers to meet these challenges head on. Hear from some of our partners about the challenges they’re facing. Email support available Tackling the digital transformation together Making the shift to digital and keeping up with always-on consumers can be difficult. To keep up with the rapid pace of change while staying relevant, and building scalable businesses for the future, innovation-led partnerships and collaborations will be critical for all players. This is why we work with our partners in APAC across five key pillars of the media industry: Content development: Leveraging new technology and data capabilities allows for the automation of media workflows, better understanding of audiences, and more effective creation of experiential content like virtual reality and augmented reality. We work with our partners to find the best means of using these technologies. Content distribution: Whether partners are looking at developing robust owned-and-operated platforms or working with third parties, we aim to help them connect with viewers while staying at the forefront of technology. Viewer acquisition and engagement: To accelerate focus on direct-to-consumer businesses, we work with our partners to drive the right viewers to the right content, enable content discovery, and facilitate deep brand engagement. Flexible monetization: With free, premium content or “freemium” emerging as the dominant revenue model for digital video, partners need to leverage monetization solutions which are suitable across advertising, subscription, and transactional business models to maximize potential across audience types. We work with them to find the right methods. Efficiency and insights: We help partners discover deeper data, insights, and workflow efficiencies, fueled by machine learning, data visualization, and analytics, via the cloud infrastructure. As the APAC broadcast and video industry continues to evolve, the importance of adapting to these changes remains constant. eMarketer, Digital Video Viewers by Countries, 2019. Share article You might also like: {[item.metadata.article_type]} {[item.title]} Read more See all resources","tag":"main"},"tag_115":{"contents":"Report APAC’s changing digital landscape: How broadcast and video companies can keep up","tag":"section"},"tag_116":{"contents":"Report APAC’s changing digital landscape: How broadcast and video companies can keep up","tag":"div"},"tag_117":{"contents":"Report APAC’s changing digital landscape: How broadcast and video companies can keep up","tag":"div"},"tag_118":{"contents":"Report APAC’s changing digital landscape: How broadcast and video companies can keep up","tag":"div"},"tag_119":{"contents":"Report APAC’s changing digital landscape: How broadcast and video companies can keep up","tag":"div"},"tag_12":{"contents":"Capabilities Partner Solutions Success Stories Resources Blog","tag":"nav"},"tag_120":{"contents":"Report APAC’s changing digital landscape: How broadcast and video companies can keep up","tag":"div"},"tag_121":{"contents":"Report APAC’s changing digital landscape: How broadcast and video companies can keep up","tag":"div"},"tag_122":{"contents":"Report","tag":"div"},"tag_123":{"contents":"Report","tag":"span"},"tag_124":{"contents":"APAC’s changing digital landscape: How broadcast and video companies can keep up","tag":"h1"},"tag_125":{"contents":"Tags Advanced TV Video","tag":"div"},"tag_126":{"contents":"Tags Advanced TV Video","tag":"div"},"tag_127":{"contents":"Tags Advanced TV Video","tag":"div"},"tag_128":{"contents":"Tags Advanced TV Video","tag":"div"},"tag_129":{"contents":"Tags","tag":"h5"},"tag_13":{"contents":"Capabilities Partner Solutions Success Stories Resources Blog","tag":"ul"},"tag_130":{"contents":"Advanced TV Video","tag":"ul"},"tag_131":{"contents":"Advanced TV","tag":"li"},"tag_132":{"contents":"Advanced TV","tag":"a"},"tag_133":{"contents":"Video","tag":"li"},"tag_134":{"contents":"Video","tag":"a"},"tag_135":{"contents":"This piece was originally published on Think With Google Asia-Pacific. The broadcast and video industry today looks very different than it did a few years ago. Broadcasters all over the world are working hard to adapt as the pace of change accelerates and scale becomes more important than ever before. Nowhere is this more true than in APAC, which has become home to more than half of all global digital video viewers (1.3 billion) — 2X more than five years ago. And with 66% of digital video viewers watching on smartphones,1 it’s clear that almost everything about the way people are consuming content — from what they watch to how they watch it — is changing. As bandwidth capabilities continue to grow, streaming will only become more affordable and accessible for consumers, leading to rapid growth in video consumption. All this change creates a constant stream of both challenges and opportunities for the industry, as competition and consumer expectations increase. Our team works with APAC broadcasters and video providers to meet these challenges head on. Hear from some of our partners about the challenges they’re facing. Email support available Tackling the digital transformation together Making the shift to digital and keeping up with always-on consumers can be difficult. To keep up with the rapid pace of change while staying relevant, and building scalable businesses for the future, innovation-led partnerships and collaborations will be critical for all players. This is why we work with our partners in APAC across five key pillars of the media industry: Content development: Leveraging new technology and data capabilities allows for the automation of media workflows, better understanding of audiences, and more effective creation of experiential content like virtual reality and augmented reality. We work with our partners to find the best means of using these technologies. Content distribution: Whether partners are looking at developing robust owned-and-operated platforms or working with third parties, we aim to help them connect with viewers while staying at the forefront of technology. Viewer acquisition and engagement: To accelerate focus on direct-to-consumer businesses, we work with our partners to drive the right viewers to the right content, enable content discovery, and facilitate deep brand engagement. Flexible monetization: With free, premium content or “freemium” emerging as the dominant revenue model for digital video, partners need to leverage monetization solutions which are suitable across advertising, subscription, and transactional business models to maximize potential across audience types. We work with them to find the right methods. Efficiency and insights: We help partners discover deeper data, insights, and workflow efficiencies, fueled by machine learning, data visualization, and analytics, via the cloud infrastructure. As the APAC broadcast and video industry continues to evolve, the importance of adapting to these changes remains constant.","tag":"article"},"tag_136":{"contents":"This piece was originally published on Think With Google Asia-Pacific. The broadcast and video industry today looks very different than it did a few years ago. Broadcasters all over the world are working hard to adapt as the pace of change accelerates and scale becomes more important than ever before. Nowhere is this more true than in APAC, which has become home to more than half of all global digital video viewers (1.3 billion) — 2X more than five years ago. And with 66% of digital video viewers watching on smartphones,1 it’s clear that almost everything about the way people are consuming content — from what they watch to how they watch it — is changing. As bandwidth capabilities continue to grow, streaming will only become more affordable and accessible for consumers, leading to rapid growth in video consumption. All this change creates a constant stream of both challenges and opportunities for the industry, as competition and consumer expectations increase. Our team works with APAC broadcasters and video providers to meet these challenges head on. Hear from some of our partners about the challenges they’re facing. Email support available Tackling the digital transformation together Making the shift to digital and keeping up with always-on consumers can be difficult. To keep up with the rapid pace of change while staying relevant, and building scalable businesses for the future, innovation-led partnerships and collaborations will be critical for all players. This is why we work with our partners in APAC across five key pillars of the media industry: Content development: Leveraging new technology and data capabilities allows for the automation of media workflows, better understanding of audiences, and more effective creation of experiential content like virtual reality and augmented reality. We work with our partners to find the best means of using these technologies. Content distribution: Whether partners are looking at developing robust owned-and-operated platforms or working with third parties, we aim to help them connect with viewers while staying at the forefront of technology. Viewer acquisition and engagement: To accelerate focus on direct-to-consumer businesses, we work with our partners to drive the right viewers to the right content, enable content discovery, and facilitate deep brand engagement. Flexible monetization: With free, premium content or “freemium” emerging as the dominant revenue model for digital video, partners need to leverage monetization solutions which are suitable across advertising, subscription, and transactional business models to maximize potential across audience types. We work with them to find the right methods. Efficiency and insights: We help partners discover deeper data, insights, and workflow efficiencies, fueled by machine learning, data visualization, and analytics, via the cloud infrastructure. As the APAC broadcast and video industry continues to evolve, the importance of adapting to these changes remains constant.","tag":"div"},"tag_137":{"contents":"This piece was originally published on Think With Google Asia-Pacific. The broadcast and video industry today looks very different than it did a few years ago. Broadcasters all over the world are working hard to adapt as the pace of change accelerates and scale becomes more important than ever before. Nowhere is this more true than in APAC, which has become home to more than half of all global digital video viewers (1.3 billion) — 2X more than five years ago. And with 66% of digital video viewers watching on smartphones,1 it’s clear that almost everything about the way people are consuming content — from what they watch to how they watch it — is changing. As bandwidth capabilities continue to grow, streaming will only become more affordable and accessible for consumers, leading to rapid growth in video consumption. All this change creates a constant stream of both challenges and opportunities for the industry, as competition and consumer expectations increase. Our team works with APAC broadcasters and video providers to meet these challenges head on. Hear from some of our partners about the challenges they’re facing. Email support available Tackling the digital transformation together Making the shift to digital and keeping up with always-on consumers can be difficult. To keep up with the rapid pace of change while staying relevant, and building scalable businesses for the future, innovation-led partnerships and collaborations will be critical for all players. This is why we work with our partners in APAC across five key pillars of the media industry: Content development: Leveraging new technology and data capabilities allows for the automation of media workflows, better understanding of audiences, and more effective creation of experiential content like virtual reality and augmented reality. We work with our partners to find the best means of using these technologies. Content distribution: Whether partners are looking at developing robust owned-and-operated platforms or working with third parties, we aim to help them connect with viewers while staying at the forefront of technology. Viewer acquisition and engagement: To accelerate focus on direct-to-consumer businesses, we work with our partners to drive the right viewers to the right content, enable content discovery, and facilitate deep brand engagement. Flexible monetization: With free, premium content or “freemium” emerging as the dominant revenue model for digital video, partners need to leverage monetization solutions which are suitable across advertising, subscription, and transactional business models to maximize potential across audience types. We work with them to find the right methods. Efficiency and insights: We help partners discover deeper data, insights, and workflow efficiencies, fueled by machine learning, data visualization, and analytics, via the cloud infrastructure. As the APAC broadcast and video industry continues to evolve, the importance of adapting to these changes remains constant.","tag":"div"},"tag_138":{"contents":"This piece was originally published on Think With Google Asia-Pacific. The broadcast and video industry today looks very different than it did a few years ago. Broadcasters all over the world are working hard to adapt as the pace of change accelerates and scale becomes more important than ever before. Nowhere is this more true than in APAC, which has become home to more than half of all global digital video viewers (1.3 billion) — 2X more than five years ago. And with 66% of digital video viewers watching on smartphones,1 it’s clear that almost everything about the way people are consuming content — from what they watch to how they watch it — is changing. As bandwidth capabilities continue to grow, streaming will only become more affordable and accessible for consumers, leading to rapid growth in video consumption. All this change creates a constant stream of both challenges and opportunities for the industry, as competition and consumer expectations increase. Our team works with APAC broadcasters and video providers to meet these challenges head on. Hear from some of our partners about the challenges they’re facing. Email support available Tackling the digital transformation together Making the shift to digital and keeping up with always-on consumers can be difficult. To keep up with the rapid pace of change while staying relevant, and building scalable businesses for the future, innovation-led partnerships and collaborations will be critical for all players. This is why we work with our partners in APAC across five key pillars of the media industry: Content development: Leveraging new technology and data capabilities allows for the automation of media workflows, better understanding of audiences, and more effective creation of experiential content like virtual reality and augmented reality. We work with our partners to find the best means of using these technologies. Content distribution: Whether partners are looking at developing robust owned-and-operated platforms or working with third parties, we aim to help them connect with viewers while staying at the forefront of technology. Viewer acquisition and engagement: To accelerate focus on direct-to-consumer businesses, we work with our partners to drive the right viewers to the right content, enable content discovery, and facilitate deep brand engagement. Flexible monetization: With free, premium content or “freemium” emerging as the dominant revenue model for digital video, partners need to leverage monetization solutions which are suitable across advertising, subscription, and transactional business models to maximize potential across audience types. We work with them to find the right methods. Efficiency and insights: We help partners discover deeper data, insights, and workflow efficiencies, fueled by machine learning, data visualization, and analytics, via the cloud infrastructure. As the APAC broadcast and video industry continues to evolve, the importance of adapting to these changes remains constant.","tag":"div"},"tag_139":{"contents":"This piece was originally published on Think With Google Asia-Pacific. The broadcast and video industry today looks very different than it did a few years ago. Broadcasters all over the world are working hard to adapt as the pace of change accelerates and scale becomes more important than ever before. Nowhere is this more true than in APAC, which has become home to more than half of all global digital video viewers (1.3 billion) — 2X more than five years ago. And with 66% of digital video viewers watching on smartphones,1 it’s clear that almost everything about the way people are consuming content — from what they watch to how they watch it — is changing. As bandwidth capabilities continue to grow, streaming will only become more affordable and accessible for consumers, leading to rapid growth in video consumption. All this change creates a constant stream of both challenges and opportunities for the industry, as competition and consumer expectations increase. Our team works with APAC broadcasters and video providers to meet these challenges head on. Hear from some of our partners about the challenges they’re facing. Email support available","tag":"section"},"tag_14":{"contents":"Capabilities","tag":"li"},"tag_140":{"contents":"This piece was originally published on Think With Google Asia-Pacific. The broadcast and video industry today looks very different than it did a few years ago. Broadcasters all over the world are working hard to adapt as the pace of change accelerates and scale becomes more important than ever before. Nowhere is this more true than in APAC, which has become home to more than half of all global digital video viewers (1.3 billion) — 2X more than five years ago. And with 66% of digital video viewers watching on smartphones,1 it’s clear that almost everything about the way people are consuming content — from what they watch to how they watch it — is changing. As bandwidth capabilities continue to grow, streaming will only become more affordable and accessible for consumers, leading to rapid growth in video consumption. All this change creates a constant stream of both challenges and opportunities for the industry, as competition and consumer expectations increase. Our team works with APAC broadcasters and video providers to meet these challenges head on. Hear from some of our partners about the challenges they’re facing.","tag":"div"},"tag_141":{"contents":"This piece was originally published on Think With Google Asia-Pacific.","tag":"p"},"tag_142":{"contents":"This piece was originally published on Think With Google Asia-Pacific.","tag":"em"},"tag_143":{"contents":"Think With Google","tag":"a"},"tag_144":{"contents":"The broadcast and video industry today looks very different than it did a few years ago. Broadcasters all over the world are working hard to adapt as the pace of change accelerates and scale becomes more important than ever before. Nowhere is this more true than in APAC, which has become home to more than half of all global digital video viewers (1.3 billion) — 2X more than five years ago. And with 66% of digital video viewers watching on smartphones,1 it’s clear that almost everything about the way people are consuming content — from what they watch to how they watch it — is changing. As bandwidth capabilities continue to grow, streaming will only become more affordable and accessible for consumers, leading to rapid growth in video consumption. All this change creates a constant stream of both challenges and opportunities for the industry, as competition and consumer expectations increase.","tag":"p"},"tag_145":{"contents":"1","tag":"sup"},"tag_146":{"contents":"Our team works with APAC broadcasters and video providers to meet these challenges head on. Hear from some of our partners about the challenges they’re facing.","tag":"p"},"tag_147":{"contents":"Email support available","tag":"div"},"tag_148":{"contents":".bg_9UI_iKBvrkM, .bg_9UI_iKBvrkM:focus{ background-image:url('https://img.youtube.com/vi/9UI_iKBvrkM/hqdefault.jpg'); }","tag":"style"},"tag_149":{"contents":"Email support available","tag":"a"},"tag_15":{"contents":"Capabilities","tag":"a"},"tag_150":{"contents":"Email support available","tag":"svg"},"tag_151":{"contents":"Email support available","tag":"title"},"tag_152":{"contents":"Tackling the digital transformation together Making the shift to digital and keeping up with always-on consumers can be difficult. To keep up with the rapid pace of change while staying relevant, and building scalable businesses for the future, innovation-led partnerships and collaborations will be critical for all players. This is why we work with our partners in APAC across five key pillars of the media industry: Content development: Leveraging new technology and data capabilities allows for the automation of media workflows, better understanding of audiences, and more effective creation of experiential content like virtual reality and augmented reality. We work with our partners to find the best means of using these technologies. Content distribution: Whether partners are looking at developing robust owned-and-operated platforms or working with third parties, we aim to help them connect with viewers while staying at the forefront of technology. Viewer acquisition and engagement: To accelerate focus on direct-to-consumer businesses, we work with our partners to drive the right viewers to the right content, enable content discovery, and facilitate deep brand engagement. Flexible monetization: With free, premium content or “freemium” emerging as the dominant revenue model for digital video, partners need to leverage monetization solutions which are suitable across advertising, subscription, and transactional business models to maximize potential across audience types. We work with them to find the right methods. Efficiency and insights: We help partners discover deeper data, insights, and workflow efficiencies, fueled by machine learning, data visualization, and analytics, via the cloud infrastructure. As the APAC broadcast and video industry continues to evolve, the importance of adapting to these changes remains constant.","tag":"section"},"tag_153":{"contents":"Tackling the digital transformation together","tag":"h2"},"tag_154":{"contents":"Making the shift to digital and keeping up with always-on consumers can be difficult. To keep up with the rapid pace of change while staying relevant, and building scalable businesses for the future, innovation-led partnerships and collaborations will be critical for all players. This is why we work with our partners in APAC across five key pillars of the media industry: Content development: Leveraging new technology and data capabilities allows for the automation of media workflows, better understanding of audiences, and more effective creation of experiential content like virtual reality and augmented reality. We work with our partners to find the best means of using these technologies. Content distribution: Whether partners are looking at developing robust owned-and-operated platforms or working with third parties, we aim to help them connect with viewers while staying at the forefront of technology. Viewer acquisition and engagement: To accelerate focus on direct-to-consumer businesses, we work with our partners to drive the right viewers to the right content, enable content discovery, and facilitate deep brand engagement. Flexible monetization: With free, premium content or “freemium” emerging as the dominant revenue model for digital video, partners need to leverage monetization solutions which are suitable across advertising, subscription, and transactional business models to maximize potential across audience types. We work with them to find the right methods. Efficiency and insights: We help partners discover deeper data, insights, and workflow efficiencies, fueled by machine learning, data visualization, and analytics, via the cloud infrastructure. As the APAC broadcast and video industry continues to evolve, the importance of adapting to these changes remains constant.","tag":"div"},"tag_155":{"contents":"Making the shift to digital and keeping up with always-on consumers can be difficult. To keep up with the rapid pace of change while staying relevant, and building scalable businesses for the future, innovation-led partnerships and collaborations will be critical for all players. This is why we work with our partners in APAC across five key pillars of the media industry:","tag":"p"},"tag_156":{"contents":"shift to digital","tag":"a"},"tag_157":{"contents":"shift to digital","tag":"span"},"tag_158":{"contents":"Content development: Leveraging new technology and data capabilities allows for the automation of media workflows, better understanding of audiences, and more effective creation of experiential content like virtual reality and augmented reality. We work with our partners to find the best means of using these technologies. Content distribution: Whether partners are looking at developing robust owned-and-operated platforms or working with third parties, we aim to help them connect with viewers while staying at the forefront of technology. Viewer acquisition and engagement: To accelerate focus on direct-to-consumer businesses, we work with our partners to drive the right viewers to the right content, enable content discovery, and facilitate deep brand engagement. Flexible monetization: With free, premium content or “freemium” emerging as the dominant revenue model for digital video, partners need to leverage monetization solutions which are suitable across advertising, subscription, and transactional business models to maximize potential across audience types. We work with them to find the right methods. Efficiency and insights: We help partners discover deeper data, insights, and workflow efficiencies, fueled by machine learning, data visualization, and analytics, via the cloud infrastructure.","tag":"ol"},"tag_159":{"contents":"Content development: Leveraging new technology and data capabilities allows for the automation of media workflows, better understanding of audiences, and more effective creation of experiential content like virtual reality and augmented reality. We work with our partners to find the best means of using these technologies.","tag":"li"},"tag_16":{"contents":"Partner Solutions","tag":"li"},"tag_160":{"contents":"Content development:","tag":"strong"},"tag_161":{"contents":"Content distribution: Whether partners are looking at developing robust owned-and-operated platforms or working with third parties, we aim to help them connect with viewers while staying at the forefront of technology.","tag":"li"},"tag_162":{"contents":"Content distribution:","tag":"strong"},"tag_163":{"contents":"Viewer acquisition and engagement: To accelerate focus on direct-to-consumer businesses, we work with our partners to drive the right viewers to the right content, enable content discovery, and facilitate deep brand engagement.","tag":"li"},"tag_164":{"contents":"Viewer acquisition and engagement:","tag":"strong"},"tag_165":{"contents":"Flexible monetization: With free, premium content or “freemium” emerging as the dominant revenue model for digital video, partners need to leverage monetization solutions which are suitable across advertising, subscription, and transactional business models to maximize potential across audience types. We work with them to find the right methods.","tag":"li"},"tag_166":{"contents":"Flexible monetization:","tag":"strong"},"tag_167":{"contents":"Efficiency and insights: We help partners discover deeper data, insights, and workflow efficiencies, fueled by machine learning, data visualization, and analytics, via the cloud infrastructure.","tag":"li"},"tag_168":{"contents":"Efficiency and insights:","tag":"strong"},"tag_169":{"contents":"As the APAC broadcast and video industry continues to evolve, the importance of adapting to these changes remains constant.","tag":"p"},"tag_17":{"contents":"Partner Solutions","tag":"a"},"tag_170":{"contents":"eMarketer, Digital Video Viewers by Countries, 2019. Share article","tag":"div"},"tag_171":{"contents":"eMarketer, Digital Video Viewers by Countries, 2019. Share article","tag":"div"},"tag_172":{"contents":"eMarketer, Digital Video Viewers by Countries, 2019. Share article","tag":"div"},"tag_173":{"contents":"eMarketer, Digital Video Viewers by Countries, 2019. Share article","tag":"div"},"tag_174":{"contents":"eMarketer, Digital Video Viewers by Countries, 2019.","tag":"div"},"tag_175":{"contents":"eMarketer, Digital Video Viewers by Countries, 2019.","tag":"ol"},"tag_176":{"contents":"eMarketer, Digital Video Viewers by Countries, 2019.","tag":"li"},"tag_177":{"contents":"eMarketer, Digital Video Viewers by Countries, 2019.","tag":"p"},"tag_178":{"contents":"eMarketer, Digital Video Viewers by Countries, 2019.","tag":"span"},"tag_179":{"contents":"Share article","tag":"div"},"tag_18":{"contents":"Success Stories","tag":"li"},"tag_180":{"contents":"Share article","tag":"div"},"tag_181":{"contents":"Share article","tag":"p"},"tag_182":{"contents":"You might also like: {[item.metadata.article_type]} {[item.title]} Read more See all resources","tag":"section"},"tag_183":{"contents":"You might also like:","tag":"div"},"tag_184":{"contents":"You might also like:","tag":"div"},"tag_185":{"contents":"You might also like:","tag":"div"},"tag_186":{"contents":"You might also like:","tag":"div"},"tag_187":{"contents":"You might also like:","tag":"h3"},"tag_188":{"contents":"{[item.metadata.article_type]} {[item.title]} Read more See all resources","tag":"div"},"tag_189":{"contents":"{[item.metadata.article_type]} {[item.title]} Read more See all resources","tag":"div"},"tag_19":{"contents":"Success Stories","tag":"a"},"tag_190":{"contents":"{[item.metadata.article_type]} {[item.title]} Read more","tag":"div"},"tag_191":{"contents":"{[item.metadata.article_type]} {[item.title]} Read more","tag":"div"},"tag_192":{"contents":"{[item.metadata.article_type]} {[item.title]} Read more","tag":"ul"},"tag_193":{"contents":"{[item.metadata.article_type]} {[item.title]} Read more","tag":"li"},"tag_194":{"contents":"{[item.metadata.article_type]} {[item.title]} Read more","tag":"a"},"tag_195":{"contents":"{[item.metadata.article_type]} {[item.title]} Read more","tag":"div"},"tag_196":{"contents":"{[item.metadata.article_type]}","tag":"div"},"tag_197":{"contents":"{[item.title]}","tag":"h3"},"tag_198":{"contents":"Read more","tag":"ul"},"tag_199":{"contents":"Read more","tag":"li"},"tag_2":{"contents":"The state of broadcast and video in APAC","tag":"title"},"tag_20":{"contents":"Resources","tag":"li"},"tag_200":{"contents":"See all resources","tag":"div"},"tag_201":{"contents":"See all resources","tag":"a"},"tag_202":{"contents":"Follow us About Google Ad Manager Overview Capabilities Partner Solutions Learning & support Support Blog Skillshop Developers & partners Google developers site Ad Manager for developers Certified Publishing Partners Related products Google Marketing Platform Google Ads Google AdSense Google AdMob Google Cloud More from Google Think with Google Google Revenue Solutions Business Solutions Google Workspace Privacy Terms About Google Google Products Help","tag":"footer"},"tag_203":{"contents":"Follow us","tag":"section"},"tag_204":{"contents":"Follow us","tag":"section"},"tag_205":{"contents":"Follow us","tag":"div"},"tag_206":{"contents":"Follow us","tag":"p"},"tag_207":{"contents":"About Google Ad Manager Overview Capabilities Partner Solutions Learning & support Support Blog Skillshop Developers & partners Google developers site Ad Manager for developers Certified Publishing Partners Related products Google Marketing Platform Google Ads Google AdSense Google AdMob Google Cloud More from Google Think with Google Google Revenue Solutions Business Solutions Google Workspace","tag":"nav"},"tag_208":{"contents":"About Google Ad Manager Overview Capabilities Partner Solutions Learning & support Support Blog Skillshop Developers & partners Google developers site Ad Manager for developers Certified Publishing Partners Related products Google Marketing Platform Google Ads Google AdSense Google AdMob Google Cloud More from Google Think with Google Google Revenue Solutions Business Solutions Google Workspace","tag":"div"},"tag_209":{"contents":"About Google Ad Manager Overview Capabilities Partner Solutions Learning & support Support Blog Skillshop Developers & partners Google developers site Ad Manager for developers Certified Publishing Partners Related products Google Marketing Platform Google Ads Google AdSense Google AdMob Google Cloud More from Google Think with Google Google Revenue Solutions Business Solutions Google Workspace","tag":"div"},"tag_21":{"contents":"Resources","tag":"a"},"tag_210":{"contents":"About Google Ad Manager Overview Capabilities Partner Solutions","tag":"div"},"tag_211":{"contents":"About Google Ad Manager","tag":"h4"},"tag_212":{"contents":"Overview Capabilities Partner Solutions","tag":"div"},"tag_213":{"contents":"Overview Capabilities Partner Solutions","tag":"ul"},"tag_214":{"contents":"Overview","tag":"li"},"tag_215":{"contents":"Overview","tag":"a"},"tag_216":{"contents":"Capabilities","tag":"li"},"tag_217":{"contents":"Capabilities","tag":"a"},"tag_218":{"contents":"Partner Solutions","tag":"li"},"tag_219":{"contents":"Partner Solutions","tag":"a"},"tag_22":{"contents":"Blog","tag":"li"},"tag_220":{"contents":"Learning & support Support Blog Skillshop","tag":"div"},"tag_221":{"contents":"Learning & support","tag":"h4"},"tag_222":{"contents":"Support Blog Skillshop","tag":"div"},"tag_223":{"contents":"Support Blog Skillshop","tag":"ul"},"tag_224":{"contents":"Support","tag":"li"},"tag_225":{"contents":"Support","tag":"a"},"tag_226":{"contents":"Blog","tag":"li"},"tag_227":{"contents":"Blog","tag":"a"},"tag_228":{"contents":"Skillshop","tag":"li"},"tag_229":{"contents":"Skillshop","tag":"a"},"tag_23":{"contents":"Blog","tag":"a"},"tag_230":{"contents":"Developers & partners Google developers site Ad Manager for developers Certified Publishing Partners","tag":"div"},"tag_231":{"contents":"Developers & partners","tag":"h4"},"tag_232":{"contents":"Google developers site Ad Manager for developers Certified Publishing Partners","tag":"div"},"tag_233":{"contents":"Google developers site Ad Manager for developers Certified Publishing Partners","tag":"ul"},"tag_234":{"contents":"Google developers site","tag":"li"},"tag_235":{"contents":"Google developers site","tag":"a"},"tag_236":{"contents":"Ad Manager for developers","tag":"li"},"tag_237":{"contents":"Ad Manager for developers","tag":"a"},"tag_238":{"contents":"Certified Publishing Partners","tag":"li"},"tag_239":{"contents":"Certified Publishing Partners","tag":"a"},"tag_24":{"contents":"Support Sign in Get started","tag":"div"},"tag_240":{"contents":"Related products Google Marketing Platform Google Ads Google AdSense Google AdMob Google Cloud","tag":"div"},"tag_241":{"contents":"Related products","tag":"h4"},"tag_242":{"contents":"Google Marketing Platform Google Ads Google AdSense Google AdMob Google Cloud","tag":"div"},"tag_243":{"contents":"Google Marketing Platform Google Ads Google AdSense Google AdMob Google Cloud","tag":"ul"},"tag_244":{"contents":"Google Marketing Platform","tag":"li"},"tag_245":{"contents":"Google Marketing Platform","tag":"a"},"tag_246":{"contents":"Google Ads","tag":"li"},"tag_247":{"contents":"Google Ads","tag":"a"},"tag_248":{"contents":"Google AdSense","tag":"li"},"tag_249":{"contents":"Google AdSense","tag":"a"},"tag_25":{"contents":"Support Sign in Get started","tag":"ul"},"tag_250":{"contents":"Google AdMob","tag":"li"},"tag_251":{"contents":"Google AdMob","tag":"a"},"tag_252":{"contents":"Google Cloud","tag":"li"},"tag_253":{"contents":"Google Cloud","tag":"a"},"tag_254":{"contents":"More from Google Think with Google Google Revenue Solutions Business Solutions Google Workspace","tag":"div"},"tag_255":{"contents":"More from Google","tag":"h4"},"tag_256":{"contents":"Think with Google Google Revenue Solutions Business Solutions Google Workspace","tag":"div"},"tag_257":{"contents":"Think with Google Google Revenue Solutions Business Solutions Google Workspace","tag":"ul"},"tag_258":{"contents":"Think with Google","tag":"li"},"tag_259":{"contents":"Think with Google","tag":"a"},"tag_26":{"contents":"Support","tag":"li"},"tag_260":{"contents":"Google Revenue Solutions","tag":"li"},"tag_261":{"contents":"Google Revenue Solutions","tag":"a"},"tag_262":{"contents":"Business Solutions","tag":"li"},"tag_263":{"contents":"Business Solutions","tag":"a"},"tag_264":{"contents":"Google Workspace","tag":"li"},"tag_265":{"contents":"Google Workspace","tag":"a"},"tag_266":{"contents":"Privacy Terms About Google Google Products Help","tag":"section"},"tag_267":{"contents":"Privacy Terms About Google Google Products","tag":"ul"},"tag_268":{"contents":"Privacy","tag":"li"},"tag_269":{"contents":"Privacy","tag":"a"},"tag_27":{"contents":"Support","tag":"a"},"tag_270":{"contents":"Terms","tag":"li"},"tag_271":{"contents":"Terms","tag":"a"},"tag_272":{"contents":"About Google","tag":"li"},"tag_273":{"contents":"About Google","tag":"a"},"tag_274":{"contents":"Google Products","tag":"li"},"tag_275":{"contents":"Google Products","tag":"a"},"tag_276":{"contents":"Help","tag":"ul"},"tag_277":{"contents":"Help","tag":"li"},"tag_278":{"contents":"Help","tag":"a"},"tag_279":{"contents":"const dataCategory = 'resources: articles'; const dataLabel = 'resources: apacs changing digital landscape: how broadcast and video companies can keep up';","tag":"script"},"tag_28":{"contents":"Sign in","tag":"li"},"tag_29":{"contents":"Sign in","tag":"a"},"tag_3":{"contents":"window.dataLayer = [{ 'siteName': 'gam', 'pageName': 'resources: articles', 'country': 'us', 'region': 'noram', 'language': 'ALL', 'resType': 'report', 'resProduct': ['ad manager'] }];","tag":"script"},"tag_30":{"contents":"Get started","tag":"li"},"tag_31":{"contents":"Get started","tag":"a"},"tag_32":{"contents":"Ad Manager Capabilities Formats Video Yield Management Data & Insights Brand Safety Partner Solutions Apps TV & Broadcast Commerce News & Publishing Small Business Success Stories Resources Blog Support Sign in Get started","tag":"div"},"tag_33":{"contents":"Ad Manager Capabilities Formats Video Yield Management Data & Insights Brand Safety Partner Solutions Apps TV & Broadcast Commerce News & Publishing Small Business Success Stories Resources Blog","tag":"div"},"tag_34":{"contents":"Ad Manager","tag":"div"},"tag_35":{"contents":"Ad Manager","tag":"div"},"tag_36":{"contents":"Ad Manager","tag":"div"},"tag_37":{"contents":"Ad Manager","tag":"div"},"tag_38":{"contents":"Ad Manager","tag":"span"},"tag_39":{"contents":"Ad Manager","tag":"a"},"tag_4":{"contents":"(function(w,d,s,l,i){w[l]=w[l]||[];w[l].push({'gtm.start': new Date().getTime(),event:'gtm.js'});var f=d.getElementsByTagName(s)[0], j=d.createElement(s),dl=l!='dataLayer'?'&l='+l:'';j.async=true;j.src= 'https://www.googletagmanager.com/gtm.js?id='+i+dl;f.parentNode.insertBefore(j,f); })(window,document,'script','dataLayer','GTM-MPHTW35'); window.dataLayer.push({'gtm.blacklist': ['customScripts']});","tag":"script"},"tag_40":{"contents":"Ad Manager","tag":"span"},"tag_41":{"contents":"Capabilities Formats Video Yield Management Data & Insights Brand Safety Partner Solutions Apps TV & Broadcast Commerce News & Publishing Small Business Success Stories Resources Blog","tag":"nav"},"tag_42":{"contents":"Capabilities Formats Video Yield Management Data & Insights Brand Safety Partner Solutions Apps TV & Broadcast Commerce News & Publishing Small Business Success Stories Resources Blog","tag":"ul"},"tag_43":{"contents":"Capabilities Formats Video Yield Management Data & Insights Brand Safety","tag":"li"},"tag_44":{"contents":"Capabilities","tag":"a"},"tag_45":{"contents":"Formats Video Yield Management Data & Insights Brand Safety","tag":"ul"},"tag_46":{"contents":"Formats","tag":"li"},"tag_47":{"contents":"Formats","tag":"a"},"tag_48":{"contents":"Video","tag":"li"},"tag_49":{"contents":"Video","tag":"a"},"tag_5":{"contents":"Ad Manager Capabilities Partner Solutions Success Stories Resources Blog Support Sign in Get started Ad Manager Capabilities Formats Video Yield Management Data & Insights Brand Safety Partner Solutions Apps TV & Broadcast Commerce News & Publishing Small Business Success Stories Resources Blog Support Sign in Get started × Tell us about your business Approximately how many monthly pageviews does your website have? Less than 1 million 1 million or more Do you have a Google AdSense account? Yes No Continue Congratulations! Congratulations! You are qualified to sign up for Google Ad Manager. Continue to sign up Sign Up for Google AdSense You need an AdSense account to work with Google Ad Manager. Sign up and come back after your application has been approved. Sign up Report APAC’s changing digital landscape: How broadcast and video companies can keep up Tags Advanced TV Video This piece was originally published on Think With Google Asia-Pacific. The broadcast and video industry today looks very different than it did a few years ago. Broadcasters all over the world are working hard to adapt as the pace of change accelerates and scale becomes more important than ever before. Nowhere is this more true than in APAC, which has become home to more than half of all global digital video viewers (1.3 billion) — 2X more than five years ago. And with 66% of digital video viewers watching on smartphones,1 it’s clear that almost everything about the way people are consuming content — from what they watch to how they watch it — is changing. As bandwidth capabilities continue to grow, streaming will only become more affordable and accessible for consumers, leading to rapid growth in video consumption. All this change creates a constant stream of both challenges and opportunities for the industry, as competition and consumer expectations increase. Our team works with APAC broadcasters and video providers to meet these challenges head on. Hear from some of our partners about the challenges they’re facing. Email support available Tackling the digital transformation together Making the shift to digital and keeping up with always-on consumers can be difficult. To keep up with the rapid pace of change while staying relevant, and building scalable businesses for the future, innovation-led partnerships and collaborations will be critical for all players. This is why we work with our partners in APAC across five key pillars of the media industry: Content development: Leveraging new technology and data capabilities allows for the automation of media workflows, better understanding of audiences, and more effective creation of experiential content like virtual reality and augmented reality. We work with our partners to find the best means of using these technologies. Content distribution: Whether partners are looking at developing robust owned-and-operated platforms or working with third parties, we aim to help them connect with viewers while staying at the forefront of technology. Viewer acquisition and engagement: To accelerate focus on direct-to-consumer businesses, we work with our partners to drive the right viewers to the right content, enable content discovery, and facilitate deep brand engagement. Flexible monetization: With free, premium content or “freemium” emerging as the dominant revenue model for digital video, partners need to leverage monetization solutions which are suitable across advertising, subscription, and transactional business models to maximize potential across audience types. We work with them to find the right methods. Efficiency and insights: We help partners discover deeper data, insights, and workflow efficiencies, fueled by machine learning, data visualization, and analytics, via the cloud infrastructure. As the APAC broadcast and video industry continues to evolve, the importance of adapting to these changes remains constant. eMarketer, Digital Video Viewers by Countries, 2019. Share article You might also like: {[item.metadata.article_type]} {[item.title]} Read more See all resources Follow us About Google Ad Manager Overview Capabilities Partner Solutions Learning & support Support Blog Skillshop Developers & partners Google developers site Ad Manager for developers Certified Publishing Partners Related products Google Marketing Platform Google Ads Google AdSense Google AdMob Google Cloud More from Google Think with Google Google Revenue Solutions Business Solutions Google Workspace Privacy Terms About Google Google Products Help","tag":"body"},"tag_50":{"contents":"Yield Management","tag":"li"},"tag_51":{"contents":"Yield Management","tag":"a"},"tag_52":{"contents":"Data & Insights","tag":"li"},"tag_53":{"contents":"Data & Insights","tag":"a"},"tag_54":{"contents":"Brand Safety","tag":"li"},"tag_55":{"contents":"Brand Safety","tag":"a"},"tag_56":{"contents":"Partner Solutions Apps TV & Broadcast Commerce News & Publishing Small Business","tag":"li"},"tag_57":{"contents":"Partner Solutions","tag":"a"},"tag_58":{"contents":"Apps TV & Broadcast Commerce News & Publishing Small Business","tag":"ul"},"tag_59":{"contents":"Apps","tag":"li"},"tag_6":{"contents":"Ad Manager Capabilities Partner Solutions Success Stories Resources Blog Support Sign in Get started Ad Manager Capabilities Formats Video Yield Management Data & Insights Brand Safety Partner Solutions Apps TV & Broadcast Commerce News & Publishing Small Business Success Stories Resources Blog Support Sign in Get started","tag":"div"},"tag_60":{"contents":"Apps","tag":"a"},"tag_61":{"contents":"TV & Broadcast","tag":"li"},"tag_62":{"contents":"TV & Broadcast","tag":"a"},"tag_63":{"contents":"Commerce","tag":"li"},"tag_64":{"contents":"Commerce","tag":"a"},"tag_65":{"contents":"News & Publishing","tag":"li"},"tag_66":{"contents":"News & Publishing","tag":"a"},"tag_67":{"contents":"Small Business","tag":"li"},"tag_68":{"contents":"Small Business","tag":"a"},"tag_69":{"contents":"Success Stories","tag":"li"},"tag_7":{"contents":"Ad Manager Capabilities Partner Solutions Success Stories Resources Blog Support Sign in Get started","tag":"div"},"tag_70":{"contents":"Success Stories","tag":"a"},"tag_71":{"contents":"Resources","tag":"li"},"tag_72":{"contents":"Resources","tag":"a"},"tag_73":{"contents":"Blog","tag":"li"},"tag_74":{"contents":"Blog","tag":"a"},"tag_75":{"contents":"Support Sign in Get started","tag":"div"},"tag_76":{"contents":"Support Sign in Get started","tag":"ul"},"tag_77":{"contents":"Support","tag":"li"},"tag_78":{"contents":"Support","tag":"a"},"tag_79":{"contents":"Sign in","tag":"li"},"tag_8":{"contents":"Ad Manager","tag":"div"},"tag_80":{"contents":"Sign in","tag":"a"},"tag_81":{"contents":"Get started","tag":"li"},"tag_82":{"contents":"Get started","tag":"a"},"tag_83":{"contents":"× Tell us about your business Approximately how many monthly pageviews does your website have? Less than 1 million 1 million or more Do you have a Google AdSense account? Yes No Continue Congratulations! Congratulations! You are qualified to sign up for Google Ad Manager. Continue to sign up Sign Up for Google AdSense You need an AdSense account to work with Google Ad Manager. Sign up and come back after your application has been approved. Sign up","tag":"div"},"tag_84":{"contents":"× Tell us about your business Approximately how many monthly pageviews does your website have? Less than 1 million 1 million or more Do you have a Google AdSense account? Yes No Continue Congratulations! Congratulations! You are qualified to sign up for Google Ad Manager. Continue to sign up Sign Up for Google AdSense You need an AdSense account to work with Google Ad Manager. Sign up and come back after your application has been approved. Sign up","tag":"div"},"tag_85":{"contents":"×","tag":"span"},"tag_86":{"contents":"Tell us about your business Approximately how many monthly pageviews does your website have? Less than 1 million 1 million or more Do you have a Google AdSense account? Yes No Continue Congratulations! Congratulations! You are qualified to sign up for Google Ad Manager. Continue to sign up Sign Up for Google AdSense You need an AdSense account to work with Google Ad Manager. Sign up and come back after your application has been approved. Sign up","tag":"form"},"tag_87":{"contents":"Tell us about your business Approximately how many monthly pageviews does your website have? Less than 1 million 1 million or more Do you have a Google AdSense account? Yes No Continue","tag":"div"},"tag_88":{"contents":"Tell us about your business Approximately how many monthly pageviews does your website have? Less than 1 million 1 million or more","tag":"div"},"tag_89":{"contents":"Tell us about your business","tag":"h2"},"tag_9":{"contents":"Ad Manager","tag":"div"},"tag_90":{"contents":"Approximately how many monthly pageviews does your website have?","tag":"p"},"tag_91":{"contents":"Less than 1 million","tag":"div"},"tag_92":{"contents":"Less than 1 million","tag":"label"},"tag_93":{"contents":"1 million or more","tag":"div"},"tag_94":{"contents":"1 million or more","tag":"label"},"tag_95":{"contents":"Do you have a Google AdSense account? Yes No","tag":"div"},"tag_96":{"contents":"Do you have a Google AdSense account?","tag":"p"},"tag_97":{"contents":"Yes","tag":"div"},"tag_98":{"contents":"Yes","tag":"label"},"tag_99":{"contents":"No","tag":"div"}}
